"""
List of labels.
Auto-generated with `python -m scripts`.
"""

# START
labels = {
    "αγγλισμός": {
        "link": "αγγλισμός",
        "linkshow": "αγγλισμός",
    },
    "αγιογραφία": {
        "link": "αγιογραφία",
        "linkshow": "αγιογραφία",
    },
    "αεροπορικός όρος": {
        "link": "αεροπορία",
        "linkshow": "αεροπορικός όρος",
    },
    "αθλητισμός": {
        "link": "αθλητισμός",
        "linkshow": "αθλητισμός",
    },
    "ακουστική": {
        "link": "ακουστική",
        "linkshow": "ακουστική",
    },
    "άλγεβρα": {
        "link": "άλγεβρα",
        "linkshow": "άλγεβρα",
    },
    "αλιεία": {
        "link": "αλιεία",
        "linkshow": "αλιεία",
    },
    "αλληλοπαθητικό": {
        "link": "αλληλοπαθητικός",
        "linkshow": "αλληλοπαθητικό",
    },
    "αλφάβητο": {
        "link": "αλφάβητο",
        "linkshow": "αλφάβητο",
    },
    "αμερ": {
        "link": "αμερικανικά αγγλικά",
        "linkshow": "αμερικανικά αγγλικά",
    },
    "αμερ γρ": {
        "link": "αμερικανική γραφή",
        "linkshow": "αμερικανική γραφή",
    },
    "αμερ σημασία": {
        "link": "ΗΠΑ",
        "linkshow": "αμερικανική σημασία",
    },
    "αμινοξύ": {
        "link": "αμινοξύ",
        "linkshow": "αμινοξύ",
    },
    "άμπελος": {
        "link": "άμπελος",
        "linkshow": "ποικιλία αμπέλου",
    },
    "άμπελος-ελλ": {
        "link": "άμπελος",
        "linkshow": "ελληνική ποικιλία αμπέλου",
    },
    "αμπελουργία": {
        "link": "αμπελουργία",
        "linkshow": "αμπελουργία",
    },
    "αμφίβιο": {
        "link": "αμφίβιο",
        "linkshow": "αμφίβιο",
    },
    "αναδανεισμός": {
        "link": "αναδανεισμός",
        "linkshow": "αναδανεισμός",
    },
    "αναδιπλασιασμός": {
        "link": "αναδιπλασιασμός",
        "linkshow": "με αναδιπλασιασμό",
    },
    "αναδρομικός": {
        "link": "αναδρομικός σχηματισμός",
        "linkshow": "αναδρομικός σχηματισμός",
    },
    "ανατομία": {
        "link": "ανατομία",
        "linkshow": "ανατομία",
    },
    "άνεμος": {
        "link": "άνεμος",
        "linkshow": "άνεμος",
    },
    "ανεπίσημο": {
        "link": "ανεπίσημος",
        "linkshow": "ανεπίσημο",
    },
    "ανθρώπινο σώμα": {
        "link": "σώμα",
        "linkshow": "ανθρώπινο σώμα",
    },
    "ανθρωπολογία": {
        "link": "ανθρωπολογία",
        "linkshow": "ανθρωπολογία",
    },
    "αντιδάνειο": {
        "link": "αντιδάνειο",
        "linkshow": "αντιδάνειο",
    },
    "λόγιο αντιδάνειο": {
        "link": "αντιδάνειο",
        "linkshow": "αντιδάνειο",
    },
    "αντικείμενο": {
        "link": "αντικείμενο",
        "linkshow": "αντικείμενο",
    },
    "αναφορική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "αναφορική αντωνυμία",
    },
    "αόριστη αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "αόριστη αντωνυμία",
    },
    "αυτοπαθής αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "αυτοπαθής αντωνυμία",
    },
    "δεικτική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "δεικτική αντωνυμία",
    },
    "επιμεριστική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "επιμεριστική αντωνυμία",
    },
    "ερωτηματική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "ερωτηματική αντωνυμία",
    },
    "κτητική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "κτητική αντωνυμία",
    },
    "οριστική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "οριστική αντωνυμία",
    },
    "προσωπική αντωνυμία": {
        "link": "αντωνυμία",
        "linkshow": "προσωπική αντωνυμία",
    },
    "αξίωμα": {
        "link": "αξίωμα",
        "linkshow": "αξίωμα",
    },
    "άπαξ": {
        "link": "άπαξ λεγόμενον",
        "linkshow": "άπαξ λεγόμενον",
    },
    "απαρχ": {
        "link": "απαρχαιωμένο",
        "linkshow": "απαρχαιωμένο",
    },
    "απλολογία": {
        "link": "απλολογία",
        "linkshow": "απλολογία",
    },
    "αποθετικό": {
        "link": "αποθετικό ρήμα",
        "linkshow": "αποθετικό ρήμα",
    },
    "απρόσωπο ρήμα": {
        "link": "απρόσωπο ρήμα",
        "linkshow": "απρόσωπο ρήμα",
    },
    "αργκό": {
        "link": "αργκό",
        "linkshow": "αργκό",
    },
    "αριθμός": {
        "link": "αριθμός",
        "linkshow": "αριθμητικό σύμβολο",
    },
    "απόλυτο αριθμητικό": {
        "link": "απόλυτο αριθμητικό",
        "linkshow": "απόλυτο αριθμητικό",
    },
    "τακτικό αριθμητικό": {
        "link": "τακτικό αριθμητικό",
        "linkshow": "τακτικό αριθμητικό",
    },
    "αναλογικό αριθμητικό": {
        "link": "αναλογικός",
        "linkshow": "αναλογικό αριθμητικό",
    },
    "πολλαπλασιαστικό αριθμητικό": {
        "link": "πολλαπλασιαστικός",
        "linkshow": "πολλαπλασιαστικό αριθμητικό",
    },
    "περιληπτικό αριθμητικό": {
        "link": "περιληπτικός",
        "linkshow": "περιληπτικό αριθμητικό",
    },
    "αριθμητικό επίθετο": {
        "link": "αριθμητικό επίθετο",
        "linkshow": "αριθμητικό επίθετο",
    },
    "αριθμητικό ουσιαστικό": {
        "link": "αριθμητικό ουσιαστικό",
        "linkshow": "αριθμητικό ουσιαστικό",
    },
    "αριθμητικό πρόθημα": {
        "link": "πρόθημα",
        "linkshow": "αριθμητικό πρόθημα",
    },
    "αριθμητική": {
        "link": "αριθμητική",
        "linkshow": "αριθμητική",
    },
    "αρχαιολογία": {
        "link": "αρχαιολογία",
        "linkshow": "αρχαιολογία",
    },
    "αρχαιοπρεπές": {
        "link": "αρχαιοπρεπής",
        "linkshow": "αρχαιοπρεπές",
    },
    "αρχιτεκτονική": {
        "link": "αρχιτεκτονική",
        "linkshow": "αρχιτεκτονική",
    },
    "αστέρας": {
        "link": "αστέρας",
        "linkshow": "αστέρας",
    },
    "αστερισμός": {
        "link": "αστερισμός",
        "linkshow": "αστερισμός",
    },
    "αστρολογία": {
        "link": "αστρολογία",
        "linkshow": "αστρολογία",
    },
    "αστροναυτική": {
        "link": "αστροναυτική",
        "linkshow": "αστροναυτική",
    },
    "αστρονομία": {
        "link": "αστρονομία",
        "linkshow": "αστρονομία",
    },
    "αφετικός": {
        "link": "άφεση",
        "linkshow": "αφετικός τύπος του",
    },
    "αφηγηματολογία": {
        "link": "αφηγηματολογία",
        "linkshow": "αφηγηματολογία",
    },
    "βαθμός": {
        "link": "βαθμός",
        "linkshow": "βαθμός ιεραρχίας",
    },
    "βαθμός πυροσβ": {
        "link": "πυροσβεστική",
        "linkshow": "βαθμός πυροσβεστικής",
    },
    "βαθμός αστυν": {
        "link": "αστυνομία",
        "linkshow": "βαθμός αστυνομίας",
    },
    "βιβλιογραφική παραπομπή": {
        "link": "βιβλιογραφία",
        "linkshow": "βιβλιογραφική παραπομπή",
    },
    "βίντεο": {
        "link": "βιντεοπαιχνίδι",
        "linkshow": "βιντεοπαιχνίδι",
    },
    "βιολογία": {
        "link": "βιολογία",
        "linkshow": "βιολογία",
    },
    "βιοχημεία": {
        "link": "βιοχημεία",
        "linkshow": "βιοχημεία",
    },
    "βοτανική": {
        "link": "βοτανική",
        "linkshow": "βοτανική",
    },
    "βότανο": {
        "link": "βότανο",
        "linkshow": "βότανο",
    },
    "βουδισμός": {
        "link": "βουδισμός",
        "linkshow": "βουδισμός",
    },
    "βρετ": {
        "link": "βρετανικός",
        "linkshow": "βρετανικά αγγλικά",
    },
    "βρετ γρ": {
        "link": "βρετανική γραφή",
        "linkshow": "βρετανική γραφή",
    },
    "βρετ σημασία": {
        "link": "βρετανικός",
        "linkshow": "βρετανική σημασία",
    },
    "γαλλισμός": {
        "link": "γαλλισμός",
        "linkshow": "γαλλισμός",
    },
    "γαστρονομία": {
        "link": "γαστρονομία",
        "linkshow": "γαστρονομία",
    },
    "γενετική": {
        "link": "γενετική",
        "linkshow": "γενετική",
    },
    "γεωγραφία": {
        "link": "γεωγραφία",
        "linkshow": "γεωγραφία",
    },
    "γεωλογία": {
        "link": "γεωλογία",
        "linkshow": "γεωλογία",
    },
    "γεωμετρία": {
        "link": "γεωμετρία",
        "linkshow": "γεωμετρία",
    },
    "γεωπονία": {
        "link": "γεωπονία",
        "linkshow": "γεωπονία",
    },
    "γλυκό": {
        "link": "γλυκό",
        "linkshow": "γλυκό",
    },
    "γλυπτική": {
        "link": "γλυπτική",
        "linkshow": "γλυπτική",
    },
    "γλώσσα": {
        "link": "γλώσσα",
        "linkshow": "γλώσσα",
    },
    "γλωσσοδέτης": {
        "link": "γλωσσοδέτης",
        "linkshow": "γλωσσοδέτης",
    },
    "γλωσσολογία": {
        "link": "γλωσσολογία",
        "linkshow": "γλωσσολογία",
    },
    "γράμμα": {
        "link": "γράμμα",
        "linkshow": "γράμμα",
    },
    "γραμματική": {
        "link": "γραμματική",
        "linkshow": "γραμματική",
    },
    "γραφή": {
        "link": "γραφή",
        "linkshow": "γραφές",
    },
    "γραφική ύλη": {
        "link": "γραφική ύλη",
        "linkshow": "γραφική ύλη",
    },
    "δασοκομία": {
        "link": "δασοκομία",
        "linkshow": "δασοκομία",
    },
    "δεινόσαυρος": {
        "link": "δεινόσαυρος",
        "linkshow": "δεινόσαυρος",
    },
    "δέντρο": {
        "link": "δέντρο",
        "linkshow": "δέντρο",
    },
    "διαφήμιση": {
        "link": "διαφήμιση",
        "linkshow": "διαφήμιση",
    },
    "διακριτικό σημάδι": {
        "link": "διακριτικό",
        "linkshow": "διακριτικό σημάδι",
    },
    "διπλωματία": {
        "link": "διπλωματία",
        "linkshow": "διπλωματία",
    },
    "ΕΕ": {
        "link": "Ευρωπαϊκή Ένωση",
        "linkshow": "Ευρωπαϊκή Ένωση",
    },
    "εθνικό": {
        "link": "εθνωνυμικό",
        "linkshow": "εθνικό όνομα",
    },
    "έθνος": {
        "link": "εθνωνύμιο",
        "linkshow": "εθνωνύμιο",
    },
    "ειρωνικό": {
        "link": "ειρωνικός",
        "linkshow": "ειρωνικό",
    },
    "ειρων σημ": {
        "link": "ειρωνικός",
        "linkshow": "ειρωνικό",
    },
    "εκκλησιαστικό": {
        "link": "εκκλησιαστικός",
        "linkshow": "εκκλησιαστικός όρος",
    },
    "εκπαίδευση": {
        "link": "εκπαίδευση",
        "linkshow": "εκπαίδευση",
    },
    "εκτύπωση": {
        "link": "εκτύπωση",
        "linkshow": "εκτύπωση",
    },
    "εκφραστικό": {
        "link": "εκφραστικός",
        "linkshow": "εκφραστικό",
    },
    "εκφραστικός αναδιπλασιασμός": {
        "link": "αναδιπλασιασμός",
        "linkshow": "εκφραστικός αναδιπλασιασμός",
    },
    "ελλειπτικό επίθετο": {
        "link": "ελλειπτικός",
        "linkshow": "ελλειπτικό επίθετο",
    },
    "ελλειπτική μετοχή": {
        "link": "ελλειπτικός",
        "linkshow": "ελλειπτική μετοχή",
    },
    "ελλειπτικό ουσιαστικό": {
        "link": "ελλειπτικός",
        "linkshow": "ελλειπτικό ουσιαστικό",
    },
    "ελλειπτικό ρήμα": {
        "link": "ελλειπτικός",
        "linkshow": "ελλειπτικό ρήμα",
    },
    "εμφατικό": {
        "link": "εμφατικός",
        "linkshow": "εμφατικό",
    },
    "ενδυμασία": {
        "link": "ενδυμασία",
        "linkshow": "ενδυμασία",
    },
    "έντομο": {
        "link": "έντομο",
        "linkshow": "έντομο",
    },
    "εντομολογία": {
        "link": "εντομολογία",
        "linkshow": "εντομολογία",
    },
    "επάγγελμα": {
        "link": "επάγγελμα",
        "linkshow": "επάγγελμα",
    },
    "επιγραφή": {
        "link": "επιγραφή",
        "linkshow": "σε επιγραφή",
    },
    "επιδημιολογία": {
        "link": "επιδημιολογία",
        "linkshow": "επιδημιολογία",
    },
    "αναφορικό επίρρημα": {
        "link": "επίρρημα",
        "linkshow": "αναφορικό επίρρημα",
    },
    "ποσοτικό επίρρημα": {
        "link": "επίρρημα",
        "linkshow": "ποσοτικό επίρρημα",
    },
    "τοπικό επίρρημα": {
        "link": "επίρρημα",
        "linkshow": "τοπικό επίρρημα",
    },
    "τροπικό επίρρημα": {
        "link": "επίρρημα",
        "linkshow": "τροπικό επίρρημα",
    },
    "χρονικό επίρρημα": {
        "link": "επίρρημα",
        "linkshow": "χρονικό επίρρημα",
    },
    "έπιπλο": {
        "link": "έπιπλο",
        "linkshow": "έπιπλο",
    },
    "επίσημο": {
        "link": "επίσημος",
        "linkshow": "επίσημο",
    },
    "επιστ": {
        "link": "επιστημονικός",
        "linkshow": "επιστημονικός όρος",
    },
    "επιστήμη": {
        "link": "επιστήμη",
        "linkshow": "επιστήμη",
    },
    "επιτατικό": {
        "link": "επιτατικός",
        "linkshow": "επιτατικό",
    },
    "επιτατικό επίθετο": {
        "link": "επιτατικός",
        "linkshow": "επιτατικό επίθετο",
    },
    "επιτατικό επιφώνημα": {
        "link": "επιτατικός",
        "linkshow": "επιτατικό επιφώνημα",
    },
    "επιτατική μετοχή": {
        "link": "επιτατικός",
        "linkshow": "επιτατική μετοχή ως επίθετο",
    },
    "επιτατικό ουσιαστικό": {
        "link": "επιτατικός",
        "linkshow": "επιτατικό ουσιαστικό",
    },
    "επιτατικό ρήμα": {
        "link": "επιτατικός",
        "linkshow": "επιτατικό ρήμα",
    },
    "εποχή": {
        "link": "εποχή",
        "linkshow": "εποχή",
    },
    "επωνυμία": {
        "link": "επωνυμία",
        "linkshow": "επωνυμία",
    },
    "εραλδική": {
        "link": "εραλδική",
        "linkshow": "εραλδική",
    },
    "εργαλείο": {
        "link": "εργαλείο",
        "linkshow": "εργαλείο",
    },
    "ερπετό": {
        "link": "ερπετό",
        "linkshow": "ερπετό",
    },
    "ερπετολογία": {
        "link": "ερπετολογία",
        "linkshow": "ερπετολογία",
    },
    "ευφημισμός": {
        "link": "ευφημισμός",
        "linkshow": "ευφημισμός",
    },
    "εφετικό": {
        "link": "εφετικός",
        "linkshow": "εφετικό",
    },
    "εφετικό ρήμα": {
        "link": "εφετικός",
        "linkshow": "εφετικό ρήμα",
    },
    "ζωγραφική": {
        "link": "ζωγραφική",
        "linkshow": "ζωγραφική",
    },
    "ζώο": {
        "link": "ζώο",
        "linkshow": "ζώο",
    },
    "ζωολογία": {
        "link": "ζωολογία",
        "linkshow": "ζωολογία",
    },
    "ηθική": {
        "link": "ηθική",
        "linkshow": "ηθική",
    },
    "ηλεκτρολογία": {
        "link": "ηλεκτρολογία",
        "linkshow": "ηλεκτρολογία",
    },
    "ηλεκτρονική": {
        "link": "ηλεκτρονική",
        "linkshow": "ηλεκτρονική",
    },
    "ημέρα": {
        "link": "ημέρα",
        "linkshow": "ημέρα",
    },
    "ηχομιμητικό": {
        "link": "ηχομιμητικός",
        "linkshow": "ηχομιμητική λέξη",
    },
    "θαλάσσιο θηλαστικό": {
        "link": "θαλάσσιο θηλαστικό",
        "linkshow": "θαλάσσιο θηλαστικό ζώο",
    },
    "θαλάσσιο ζώο": {
        "link": "θαλάσσιο ζώο",
        "linkshow": "θαλάσσιο ζώο",
    },
    "θάμνος": {
        "link": "θάμνος",
        "linkshow": "θάμνος",
    },
    "θέατρο": {
        "link": "θέατρο",
        "linkshow": "θέατρο",
    },
    "θεολογία": {
        "link": "θεολογία",
        "linkshow": "θεολογία",
    },
    "θεωνύμιο": {
        "link": "θεωνύμιο",
        "linkshow": "θεωνύμιο",
    },
    "θεωρία συνόλων": {
        "link": "θεωρία συνόλων",
        "linkshow": "θεωρία συνόλων",
    },
    "θηλαστικό": {
        "link": "Θηλαστικά",
        "linkshow": "θηλαστικό ζώο",
    },
    "θρησκεία": {
        "link": "θρησκεία",
        "linkshow": "θρησκεία",
    },
    "θωπευτικό": {
        "link": "θωπευτικός",
        "linkshow": "θωπευτικό",
    },
    "ιατρική": {
        "link": "ιατρική",
        "linkshow": "ιατρική",
    },
    "ιδιότητα": {
        "link": "ιδιότητα",
        "linkshow": "ιδιότητα",
    },
    "ιδιωματικό": {
        "link": "ιδίωμα",
        "linkshow": "ιδιωματικό",
    },
    "ιδιωματ σημ": {
        "link": "ιδίωμα",
        "linkshow": "ιδιωματικό",
    },
    "ιδιωματισμός": {
        "link": "ιδιωματισμός",
        "linkshow": "ιδιωματισμός",
    },
    "ινδουισμός": {
        "link": "ινδουισμός",
        "linkshow": "ινδουισμός",
    },
    "ιουδαϊσμός": {
        "link": "ιουδαϊσμός",
        "linkshow": "ιουδαϊσμός",
    },
    "ισλαμισμός": {
        "link": "ισλαμισμός",
        "linkshow": "ισλαμισμός",
    },
    "ιστορία": {
        "link": "ιστορία",
        "linkshow": "ιστορία",
    },
    "ιχθυολογία": {
        "link": "ιχθυολογία",
        "linkshow": "ιχθυολογία",
    },
    "καθολικισμός": {
        "link": "καθολικισμός",
        "linkshow": "καθολικισμός",
    },
    "κακόσημο": {
        "link": "κακόσημος",
        "linkshow": "κακόσημο",
    },
    "κακόσημη σημασία": {
        "link": "κακόσημος",
        "linkshow": "κακόσημο",
    },
    "καρδιολογία": {
        "link": "καρδιολογία",
        "linkshow": "καρδιολογία",
    },
    "καφές": {
        "link": "καφές",
        "linkshow": "καφές",
    },
    "κεραμική": {
        "link": "κεραμική",
        "linkshow": "κεραμική",
    },
    "κήτος": {
        "link": "κήτος",
        "linkshow": "κήτος",
    },
    "κινηματογράφος": {
        "link": "κινηματογράφος",
        "linkshow": "κινηματογράφος",
    },
    "κοινωνιολογία": {
        "link": "κοινωνιολογία",
        "linkshow": "κοινωνιολογία",
    },
    "κομμωτική": {
        "link": "κομμωτική",
        "linkshow": "κομμωτική",
    },
    "κορονοϊός": {
        "link": "κορονοϊός",
        "linkshow": "κορονοϊός",
    },
    "κοσμετολογία": {
        "link": "κοσμετολογία",
        "linkshow": "κοσμετολογία",
    },
    "κόσμημα": {
        "link": "κόσμημα",
        "linkshow": "κόσμημα",
    },
    "κουζινικά": {
        "link": "κουζινικά",
        "linkshow": "κουζινικά",
    },
    "κτηνιατρική": {
        "link": "κτηνιατρική",
        "linkshow": "κτηνιατρική",
    },
    "λαϊκό": {
        "link": "λαϊκός",
        "linkshow": "λαϊκό",
    },
    "λαϊκότροπο": {
        "link": "λαϊκότροπος",
        "linkshow": "λαϊκότροπο",
    },
    "λαογραφία": {
        "link": "λαογραφία",
        "linkshow": "λαογραφία",
    },
    "λαχανικό": {
        "link": "λαχανικό",
        "linkshow": "λαχανικό",
    },
    "λάχνισμα": {
        "link": "λάχνισμα",
        "linkshow": "λάχνισμα",
    },
    "λεξικό": {
        "link": "λεξικό",
        "linkshow": "σε λεξικό",
    },
    "λεξικογραφία": {
        "link": "λεξικογραφία",
        "linkshow": "λεξικογραφία",
    },
    "λογική": {
        "link": "λογική",
        "linkshow": "λογική",
    },
    "λόγιο": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-ουσ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-κυρ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-επ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-επίθ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-μετ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ-κλ-ρημ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λόγ σημ": {
        "link": "λόγιος",
        "linkshow": "λόγιο",
    },
    "λογιστική": {
        "link": "λογιστική",
        "linkshow": "λογιστική",
    },
    "λογοτεχνία": {
        "link": "λογοτεχνία",
        "linkshow": "λογοτεχνία",
    },
    "λογοτεχνικό": {
        "link": "λογοτεχνικός",
        "linkshow": "λογοτεχνικό",
    },
    "λουλούδι": {
        "link": "λουλούδι",
        "linkshow": "λουλούδι",
    },
    "μαγειρική": {
        "link": "μαγειρική",
        "linkshow": "μαγειρική",
    },
    "μαθηματικά": {
        "link": "μαθηματικά",
        "linkshow": "μαθηματικά",
    },
    "μαλάκιο": {
        "link": "μαλάκιο",
        "linkshow": "μαλάκιο",
    },
    "μεγεθυντικό": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ επίθετο": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ επίθημα": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ επίρρημα": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ κύριο": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μεγ ουσ": {
        "link": "μεγεθυντικό",
        "linkshow": "μεγεθυντικό",
    },
    "μειωτικό": {
        "link": "μειωτικός",
        "linkshow": "μειωτικό",
    },
    "μειωτ σημ": {
        "link": "μειωτικός",
        "linkshow": "μειωτικό",
    },
    "μέσο μεταφορών": {
        "link": "μεταφορά",
        "linkshow": "μέσο μεταφορών",
    },
    "μετάθεση": {
        "link": "μετάθεση",
        "linkshow": "μετάθεση",
    },
    "μετακίνηση τόνου": {
        "link": "μετακίνηση",
        "linkshow": "μετακίνηση τόνου",
    },
    "μεταλλουργία": {
        "link": "μεταλλουργία",
        "linkshow": "μεταλλουργία",
    },
    "μεταφορικά": {
        "link": "μεταφορά#φιλολογία",
        "linkshow": "μεταφορικά",
    },
    "μετεωρολογία": {
        "link": "μετεωρολογία",
        "linkshow": "μετεωρολογία",
    },
    "μετρική": {
        "link": "μετρική",
        "linkshow": "μετρική",
    },
    "μετωνυμία": {
        "link": "μετωνυμία",
        "linkshow": "μετωνυμία",
    },
    "μήνας": {
        "link": "μήνας",
        "linkshow": "μήνας",
    },
    "μήνας του αττικού ημερολογίου": {
        "link": "αττικό ημερολόγιο",
        "linkshow": "μήνας του αττικού ημερολογίου",
    },
    "μητρωνυμικό": {
        "link": "μητρωνυμικό",
        "linkshow": "μητρωνυμικό",
    },
    "μηχανή": {
        "link": "μηχανή",
        "linkshow": "μηχανή",
    },
    "μηχανική": {
        "link": "μηχανική",
        "linkshow": "μηχανική",
    },
    "μηχανολογία": {
        "link": "μηχανολογία",
        "linkshow": "μηχανολογία",
    },
    "μικροβιολογία": {
        "link": "μικροβιολογία",
        "linkshow": "μικροβιολογία",
    },
    "μόδα": {
        "link": "μόδα",
        "linkshow": "μόδα",
    },
    "μονάδα μέτρησης": {
        "link": "μονάδα μέτρησης",
        "linkshow": "μονάδα μέτρησης",
    },
    "μουσική": {
        "link": "μουσική",
        "linkshow": "μουσική",
    },
    "βυζαντινή μουσική": {
        "link": "βυζαντινή μουσική",
        "linkshow": "βυζαντινή μουσική",
    },
    "μουσ όργ": {
        "link": "μουσικό όργανο",
        "linkshow": "μουσικό όργανο",
    },
    "μπαχαρικό": {
        "link": "μπαχαρικό",
        "linkshow": "μπαχαρικό",
    },
    "μυθολογία": {
        "link": "μυθολογία",
        "linkshow": "μυθολογία",
    },
    "ελληνική μυθολογία": {
        "link": "μυθολογία",
        "linkshow": "ελληνική μυθολογία",
    },
    "αγγλική μυθολογία": {
        "link": "αγγλικός",
        "linkshow": "αγγλική μυθολογία",
    },
    "αιγυπτιακή μυθολογία": {
        "link": "αιγυπτιακός",
        "linkshow": "αιγυπτιακή μυθολογία",
    },
    "καταλανική μυθολογία": {
        "link": "καταλανικός",
        "linkshow": "καταλανική μυθολογία",
    },
    "σκανδιναβική μυθολογία": {
        "link": "σκανδιναβικός",
        "linkshow": "σκανδιναβική μυθολογία",
    },
    "ρωμαϊκή μυθολογία": {
        "link": "ρωμαϊκός",
        "linkshow": "ρωμαϊκή μυθολογία",
    },
    "μυκητολογία": {
        "link": "μυκητολογία",
        "linkshow": "μυκητολογία",
    },
    "ναυπηγική": {
        "link": "ναυπηγική",
        "linkshow": "ναυπηγική",
    },
    "ναυπηγικός όρος": {
        "link": "ναυπηγική",
        "linkshow": "ναυπηγικός όρος",
    },
    "ναυτικός όρος": {
        "link": "ναυτικός",
        "linkshow": "ναυτικός όρος",
    },
    "νευρολογία": {
        "link": "νευρολογία",
        "linkshow": "νευρολογία",
    },
    "νεολογισμός": {
        "link": "νεολογισμός",
        "linkshow": "νεολογισμός",
    },
    "νομ": {
        "link": "νομική",
        "linkshow": "νομικός όρος",
    },
    "νόμισμα": {
        "link": "νόμισμα",
        "linkshow": "νόμισμα",
    },
    "οδοντιατρική": {
        "link": "οδοντιατρική",
        "linkshow": "οδοντιατρική",
    },
    "οικείο": {
        "link": "οικείος",
        "linkshow": "οικείο",
    },
    "οικεία σημ": {
        "link": "οικείος",
        "linkshow": "οικείο",
    },
    "οικογένεια": {
        "link": "οικογένεια",
        "linkshow": "οικογένεια",
    },
    "οικοδομική": {
        "link": "οικοδομική",
        "linkshow": "οικοδομική",
    },
    "οικολογία": {
        "link": "οικολογία",
        "linkshow": "οικολογία",
    },
    "οικονομία": {
        "link": "οικονομία",
        "linkshow": "οικονομία",
    },
    "ομοτική έκφραση": {
        "link": "ομοτική έκφραση",
        "linkshow": "ομοτική έκφραση",
    },
    "όνομα ζώου": {
        "link": "ζωωνύμιο",
        "linkshow": "όνομα ζώου",
    },
    "ονοματεπώνυμο": {
        "link": "ονοματεπώνυμο",
        "linkshow": "ονοματεπώνυμο",
    },
    "οπλισμός": {
        "link": "οπλισμός",
        "linkshow": "οπλισμός",
    },
    "οπτική": {
        "link": "οπτική",
        "linkshow": "οπτική",
    },
    "ορνιθολογία": {
        "link": "ορνιθολογία",
        "linkshow": "ορνιθολογία",
    },
    "ορυκτολογία": {
        "link": "ορυκτολογία",
        "linkshow": "ορυκτολογία",
    },
    "όσπριο": {
        "link": "όσπριο",
        "linkshow": "όσπριο",
    },
    "πάθηση": {
        "link": "πάθηση",
        "linkshow": "πάθηση",
    },
    "παιχνίδι": {
        "link": "παιχνίδι",
        "linkshow": "παιχνίδι",
    },
    "παιχνίδι-αντικείμενο": {
        "link": "παιχνίδι",
        "linkshow": "παιχνίδι",
    },
    "παλαιογραφία": {
        "link": "παλαιογραφία",
        "linkshow": "παλαιογραφία",
    },
    "παλαιοντολογία": {
        "link": "παλαιοντολογία",
        "linkshow": "παλαιοντολογία",
    },
    "πάπυρος": {
        "link": "πάπυρος",
        "linkshow": "σε πάπυρο",
    },
    "παραμύθι": {
        "link": "παραμύθι",
        "linkshow": "παραμύθι",
    },
    "παρετυμολογία": {
        "link": "παρετυμολογία",
        "linkshow": "παρετυμολογία",
    },
    "παρομοίωση": {
        "link": "παρομοίωση",
        "linkshow": "παρομοίωση",
    },
    "παρωνύμιο": {
        "link": "παρωνύμιο",
        "linkshow": "παρωνύμιο",
    },
    "παρωχημένο": {
        "link": "παρωχημένος",
        "linkshow": "παρωχημένο",
    },
    "παρωχ γραφή": {
        "link": "παρωχημένος",
        "linkshow": "παρωχημένο",
    },
    "παρωχ σημ": {
        "link": "παρωχημένος",
        "linkshow": "παρωχημένο",
    },
    "πατριδωνυμικό": {
        "link": "πατριδωνυμικό",
        "linkshow": "πατριδωνυμικό",
    },
    "πατρότητα": {
        "link": "πατρότητα",
        "linkshow": "",
    },
    "πατρωνυμικό": {
        "link": "πατρωνυμικό",
        "linkshow": "πατρωνυμικό",
    },
    "περικοπή": {
        "link": "περικοπή",
        "linkshow": "περικοπή του",
    },
    "περιληπτικό": {
        "link": "περιληπτικός",
        "linkshow": "περιληπτικό",
    },
    "πολιτική": {
        "link": "πολιτική",
        "linkshow": "πολιτική",
    },
    "ποτό": {
        "link": "ποτό",
        "linkshow": "ποτό",
    },
    "πτηνό": {
        "link": "πτηνό",
        "linkshow": "πτηνό",
    },
    "προεξαγγελτικό": {
        "link": "προεξαγγελτικός",
        "linkshow": "προεξαγγελτικό",
    },
    "προσφώνηση": {
        "link": "προσφώνηση",
        "linkshow": "προσφώνηση",
    },
    "προσωνυμία": {
        "link": "προσωνυμία",
        "linkshow": "προσωνυμία",
    },
    "προφορικό": {
        "link": "προφορικός",
        "linkshow": "προφορικό",
    },
    "ρημ επίθ": {
        "link": "ρηματικό επίθετο",
        "linkshow": "ρηματικό επίθετο",
    },
    "σεισμολογία": {
        "link": "σεισμολογία",
        "linkshow": "σεισμολογία",
    },
    "σημείο στίξης": {
        "link": "σημείο στίξης",
        "linkshow": "σημείο στίξης",
    },
    "σκάκι": {
        "link": "σκάκι",
        "linkshow": "σκάκι",
    },
    "σκωπτικό": {
        "link": "σκωπτικός",
        "linkshow": "σκωπτικό",
    },
    "σκωπτ σημ": {
        "link": "σκωπτικός",
        "linkshow": "σκωπτικό",
    },
    "σπάνιο": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-ουσ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-κυρ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-επ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-επίθ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-μετ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάν-κλ-ρημ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "σπάνια σημ": {
        "link": "σπάνιος",
        "linkshow": "σπάνιο",
    },
    "στατιστική": {
        "link": "στατιστική",
        "linkshow": "στατιστική",
    },
    "στρατιωτικός όρος": {
        "link": "στρατιωτικός",
        "linkshow": "στρατιωτικός όρος",
    },
    "στρατ βαθμός": {
        "link": "στρατιωτικός",
        "linkshow": "στρατιωτικός βαθμός",
    },
    "στρατ αργκό": {
        "link": "αργκό",
        "linkshow": "στρατιωτική αργκό",
    },
    "στοιχειώδες σωματίδιο": {
        "link": "σωματίδιο",
        "linkshow": "στοιχειώδες σωματίδιο",
    },
    "συμφυρμός": {
        "link": "συμφυρμός",
        "linkshow": "συμφυρμός των",
    },
    "συνηρημένο": {
        "link": "συνηρημένος",
        "linkshow": "συνηρημένο",
    },
    "σνρ επίθετο": {
        "link": "συνηρημένος",
        "linkshow": "συνηρημένο",
    },
    "σνρ μετοχή": {
        "link": "συνηρημένος",
        "linkshow": "συνηρημένο",
    },
    "σνρ ουσιαστικό": {
        "link": "συνηρημένος",
        "linkshow": "συνηρημένο",
    },
    "σνρ ρήμα": {
        "link": "συνηρημένος",
        "linkshow": "συνηρημένο",
    },
    "αντικειμενικό σύνθετο": {
        "link": "σύνθετο",
        "linkshow": "αντικειμενικό σύνθετο",
    },
    "κτητικό σύνθετο": {
        "link": "σύνθετο",
        "linkshow": "κτητικό σύνθετο",
    },
    "περιστασιακή σύνθεση": {
        "link": "περιστασιακή σύνθεση",
        "linkshow": "περιστασιακή σύνθεση",
    },
    "παρατακτικό σύνθετο": {
        "link": "σύνθετο",
        "linkshow": "παρατακτικό σύνθετο",
    },
    "προσδιοριστικό σύνθετο": {
        "link": "σύνθετο",
        "linkshow": "προσδιοριστικό σύνθετο",
    },
    "συσκευή": {
        "link": "συσκευή",
        "linkshow": "συσκευή",
    },
    "σύστημα γραφής": {
        "link": "γραφή",
        "linkshow": "σύστημα γραφής",
    },
    "σχήμα λόγου": {
        "link": "σχήμα λόγου",
        "linkshow": "σχήμα λόγου",
    },
    "σχόλιο": {
        "link": "σχόλιο",
        "linkshow": "σε σχόλια",
    },
    "ταξινομία": {
        "link": "ταξινομία",
        "linkshow": "ταξινομία",
    },
    "τέχνη": {
        "link": "τέχνη",
        "linkshow": "τέχνη",
    },
    "τεχνικός όρος": {
        "link": "τεχνικός",
        "linkshow": "τεχνικός όρος",
    },
    "τεχνολογία": {
        "link": "τεχνολογία",
        "linkshow": "τεχνολογία",
    },
    "τεχνολογία τροφίμων": {
        "link": "τεχνολογία τροφίμων",
        "linkshow": "τεχνολογία τροφίμων",
    },
    "τηλεπικοινωνίες": {
        "link": "τηλεπικοινωνία",
        "linkshow": "τηλεπικοινωνίες",
    },
    "τοπωνύμιο": {
        "link": "τοπωνύμιο",
        "linkshow": "τοπωνύμιο",
    },
    "τριτοπρόσωπο ρήμα": {
        "link": "τριτοπρόσωπο ρήμα",
        "linkshow": "τριτοπρόσωπο ρήμα",
    },
    "τρόφιμα": {
        "link": "τρόφιμο",
        "linkshow": "τρόφιμο",
    },
    "τυριά": {
        "link": "τυρί",
        "linkshow": "τυρί",
    },
    "τυπογραφία": {
        "link": "τυπογραφία",
        "linkshow": "τυπογραφία",
    },
    "υβριστικό": {
        "link": "υβριστικός",
        "linkshow": "υβριστικό",
    },
    "υδρωνύμιο": {
        "link": "υδρωνύμιο",
        "linkshow": "υδρωνύμιο",
    },
    "υπο": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "υπο επίθετο": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "υπο επίθημα": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "υπο επίρρημα": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "υπο κύριο": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "υπο ουσ": {
        "link": "υποκοριστικό",
        "linkshow": "υποκοριστικό",
    },
    "κατά δεύτερο υποκορισμό": {
        "link": "υποκορισμός",
        "linkshow": "κατά δεύτερο υποκορισμό",
    },
    "υφάσματα": {
        "link": "ύφασμα",
        "linkshow": "ύφασμα",
    },
    "υπόδηση": {
        "link": "υπόδηση",
        "linkshow": "υπόδηση",
    },
    "φαρμακευτική": {
        "link": "φαρμακευτική",
        "linkshow": "φαρμακευτική",
    },
    "φίδι": {
        "link": "φίδι",
        "linkshow": "φίδι",
    },
    "φιλολογία": {
        "link": "φιλολογία",
        "linkshow": "φιλολογία",
    },
    "φιλοσοφία": {
        "link": "φιλοσοφία",
        "linkshow": "φιλοσοφία",
    },
    "φρούτο": {
        "link": "φρούτο",
        "linkshow": "φρούτο",
    },
    "φυσική": {
        "link": "φυσική",
        "linkshow": "φυσική",
    },
    "φυσιολογία": {
        "link": "φυσιολογία",
        "linkshow": "φυσιολογία",
    },
    "φυτό": {
        "link": "φυτό",
        "linkshow": "φυτό",
    },
    "φωνή ζώου": {
        "link": "ζώο",
        "linkshow": "φωνή ζώου",
    },
    "φωνητική": {
        "link": "φωνητική",
        "linkshow": "φωνητική",
    },
    "φωνολογία": {
        "link": "φωνολογία",
        "linkshow": "φωνολογία",
    },
    "φωνητικό αλφάβητο ΝΑΤΟ": {
        "link": "φωνητικό αλφάβητο",
        "linkshow": "φωνητικό αλφάβητο ΝΑΤΟ",
    },
    "φωτογραφία": {
        "link": "φωτογραφία",
        "linkshow": "φωτογραφία",
    },
    "χαϊδευτικό": {
        "link": "χαϊδευτικός",
        "linkshow": "χαϊδευτικό",
    },
    "χαρακτήρας": {
        "link": "χαρακτήρας",
        "linkshow": "χαρακτήρας",
    },
    "χαρακτήρας Χαν": {
        "link": "Χαν",
        "linkshow": "χαρακτήρας Χαν",
    },
    "χαρακτήρας κάντζι": {
        "link": "κάντζι",
        "linkshow": "χαρακτήρας κάντζι",
    },
    "χαρτοπαίγνιο": {
        "link": "χαρτοπαίγνιο",
        "linkshow": "χαρτοπαίγνιο",
    },
    "χημεία": {
        "link": "χημεία",
        "linkshow": "χημεία",
    },
    "χημική ένωση": {
        "link": "χημική ένωση",
        "linkshow": "χημική ένωση",
    },
    "χημ-στοιχείο": {
        "link": "χημικό στοιχείο",
        "linkshow": "χημικό στοιχείο",
    },
    "χημ-σύμβολο": {
        "link": "χημικό σύμβολο",
        "linkshow": "χημικό σύμβολο",
    },
    "χορός": {
        "link": "χορός",
        "linkshow": "χορός",
    },
    "χπαθ": {
        "link": "παθητική φωνή",
        "linkshow": "χωρίς παθητική φωνή",
    },
    "χριστιανισμός": {
        "link": "χριστιανισμός",
        "linkshow": "χριστιανισμός",
    },
    "χρώμα": {
        "link": "χρώμα",
        "linkshow": "χρώμα",
    },
    "χυδαίο": {
        "link": "χυδαίος",
        "linkshow": "χυδαίο",
    },
    "χωρίς νόημα": {
        "link": "νόημα",
        "linkshow": "λέξη χωρίς νόημα",
    },
    "ψάρι": {
        "link": "ψάρι",
        "linkshow": "ψάρι",
    },
    "ψευδοδάνειο": {
        "link": "ψευδοδάνειο",
        "linkshow": "ψευδοδάνειο",
    },
    "ψυχιατρική": {
        "link": "ψυχιατρική",
        "linkshow": "ψυχιατρική",
    },
    "ψυχολογία": {
        "link": "ψυχολογία",
        "linkshow": "ψυχολογία",
    },
    "ωκεανογραφία": {
        "link": "ωκεανογραφία",
        "linkshow": "ωκεανογραφία",
    },
    "πληροφορική": {
        "link": "πληροφορική",
        "linkshow": "πληροφορική",
    },
    "HTML": {
        "link": "HTML",
        "linkshow": "HTML",
    },
    "αντικειμενοστρεφής προγραμματισμός": {
        "link": "αντικειμενοστρεφής προγραμματισμός",
        "linkshow": "αντικειμενοστρεφής προγραμματισμός",
    },
    "βάσεις δεδομένων": {
        "link": "βάση δεδομένων",
        "linkshow": "βάσεις δεδομένων",
    },
    "γλώσσες προγραμματισμού": {
        "link": "γλώσσα προγραμματισμού",
        "linkshow": "γλώσσες προγραμματισμού",
    },
    "διαδικτυακή αργκό": {
        "link": "αργκό",
        "linkshow": "διαδικτυακή αργκό",
    },
    "διαδίκτυο": {
        "link": "διαδίκτυο",
        "linkshow": "διαδίκτυο",
    },
    "δίκτυο υπολογιστών": {
        "link": "δίκτυο υπολογιστών",
        "linkshow": "δίκτυο υπολογιστών",
    },
    "επιστήμη υπολογιστών": {
        "link": "επιστήμη υπολογιστών",
        "linkshow": "επιστήμη υπολογιστών",
    },
    "κανονικές εκφράσεις": {
        "link": "κανονική έκφραση",
        "linkshow": "κανονικές εκφράσεις",
    },
    "λογισμικό": {
        "link": "λογισμικό",
        "linkshow": "λογισμικό",
    },
    "μεταγλώττιση": {
        "link": "μεταγλώττιση",
        "linkshow": "πληροφορική-μεταγλώττιση",
    },
    "προγραμματισμός": {
        "link": "προγραμματισμός",
        "linkshow": "προγραμματισμός",
    },
    "υλικό υπολογιστή": {
        "link": "hardware",
        "linkshow": "υλικό υπολογιστή",
    },
    "C++": {
        "link": "C++",
        "linkshow": "C++",
    },
    "Java": {
        "link": "Java",
        "linkshow": "Java",
    },
    "Perl": {
        "link": "Perl",
        "linkshow": "Perl",
    },
    "Python": {
        "link": "Python",
        "linkshow": "Python",
    },
    "αμετάβατο": {
        "link": "αμετάβατος",
        "linkshow": "αμετάβατο",
    },
    "αρχαϊκό": {
        "link": "αρχαϊκός",
        "linkshow": "αρχαϊκό",
    },
    "καθομιλουμένη": {
        "link": "καθομιλουμένη",
        "linkshow": "καθομιλουμένη",
    },
    "καταχρηστικά": {
        "link": "καταχρηστικός",
        "linkshow": "καταχρηστικά",
    },
    "μεταβατικό": {
        "link": "μεταβατικός",
        "linkshow": "μεταβατικό",
    },
    "μτβ+αμτβ": {
        "link": "μεταβατικός",
        "linkshow": "μεταβατικό & αμετάβατο",
    },
    "γενικότερα": {
        "link": "γενικά",
        "linkshow": "γενικότερα",
    },
    "ειδικότερα": {
        "link": "ειδικά",
        "linkshow": "ειδικότερα",
    },
    "εσφαλμένα": {
        "link": "εσφαλμένος",
        "linkshow": "εσφαλμένα",
    },
    "κτεπε": {
        "link": "κατ' επέκταση",
        "linkshow": "κατ’ επέκταση",
    },
    "κυριολεκτικά": {
        "link": "κυριολεκτώ",
        "linkshow": "κυριολεκτικά",
    },
    "σνκδ": {
        "link": "συνεκδοχικά",
        "linkshow": "συνεκδοχικά",
    },
}  # 414
# END
